#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 0s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=qbuQtbkk6v_IIzTfsV4]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=ff1640ec-3ad2-11ee-bc4a-617073747261]
null_resource.force_redeploy: Refreshing state... [id=4895034556095643304]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "4895034556095643304" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "71" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + primitive            = (known after apply)
      + routing_zone_id      = "89kVMG1nFhZIuv83ZgA"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "qbuQtbkk6v_IIzTfsV4"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template" "vpn" {
      ~ description  = "includes routing policies for [Vendor_A]" -> "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]"
        id           = "ff1640ec-3ad2-11ee-bc4a-617073747261"
        name         = "IP+BGP handoff to VPN block"
      ~ primitives   = [
          - jsonencode(
                {
                  - data = {
                      - child_primitives     = [
                          - jsonencode(
                                {
                                  - data = {
                                      - bfd_enabled          = false
                                      - child_primitives     = [
                                          - jsonencode(
                                                {
                                                  - data = {
                                                      - routing_policy_id = "qbuQtbkk6v_IIzTfsV4"
                                                    }
                                                  - type = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                        ]
                                      - hold_time            = null
                                      - ipv4_address         = "192.168.5.5"
                                      - ipv4_afi_enabled     = true
                                      - ipv6_address         = null
                                      - ipv6_afi_enabled     = false
                                      - keepalive_time       = null
                                      - local_asn            = null
                                      - neighbor_asn         = null
                                      - neighbor_asn_dynaimc = true
                                      - password             = null
                                      - ttl                  = 0
                                    }
                                  - type = "AttachIpEndpointWithBgpNsxt"
                                }
                            ),
                        ]
                      - ipv4_addressing_type = "numbered"
                      - ipv6_addressing_type = "none"
                      - routing_zone_id      = "89kVMG1nFhZIuv83ZgA"
                      - tagged               = false
                    }
                  - type = "AttachLogicalLink"
                }
            ),
          + (known after apply),
        ]
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + description         = "Vendor_B: Import count: 10 Export count: 1"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.17.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.2.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.4.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.6.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.8.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.10.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.12.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.14.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.17.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.18.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_B"
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + description         = "Vendor_C: Import count: 3 Export count: 2"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.20.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.18.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.3.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.5.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_C"
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   